""" В обувном магазине продается обувь разного размера. Известно, что одну пару обуви можно надеть на другую,
если она хотя бы на три размера больше. В магазин пришел покупатель.Требуется определить, какое наибольшее
количество пар обуви сможет предложить ему продавец так, чтобы он смог надеть их все одновременно.

Формат ввода
Сначала вводится размер ноги покупателя (обувь меньшего размера он надеть не сможет), в следующей строке — размеры каждой пары обуви в магазине через пробел. Размер — натуральное число, не превосходящее 100.

Формат вывода
Выведите единственное число — максимальное количество пар обуви, которое сможет надеть покупатель.
"""

size = int(input())
shop = sorted(list(map(int, input().split())))
shoes = []
if shop[-1] < size or len(shop) == 0:
    print("0")
elif len(shop) == 1:
    print("1")
else:
    i = 0
    while shop[i] < size:
        i += 1
    shoes = shop[i:]
    count = 1
    shoes1 = 0
    shoes2 = 1
    while shoes2 < len(shoes):
        if shoes[shoes2] - shoes[shoes1] >= 3:
            count += 1
            shoes1 = shoes2
            shoes2 += 1
        else:
            shoes2 += 1
    print(count)
